<?php

return [

    /*
    |--------------------------------------------------------------------------
    |thuế xuất mặc định
    |--------------------------------------------------------------------------
    |
    |  Đây là mức thuế xuất mặt định được áp dụng..
    |
    */

    'tax' => 10,

    /*
    |--------------------------------------------------------------------------
    | Thông số cài đặt cơ sở dữ liệu giỏ hàng
    |--------------------------------------------------------------------------
    |
    | Ở đây bạn có thể thiết lập kết nối khi muốn lưu trữ giỏ hàng
    |
    |
    */

    'database' => [

        'connection' => null,

        'table' => 'shoppingcart',

    ],

    /*
    |--------------------------------------------------------------------------
    |  Huỷ giỏ hàng khi đăng xuất
    |--------------------------------------------------------------------------
    |
    |  Nếu thiết lập này được đặt "true" thì giỏ hàng sẽ tự động bị xoá khi người dùng
    | đăng xuất khỏi hệ thống..
    |
    */

    'destroy_on_logout' => true,

    /*
    |--------------------------------------------------------------------------
    |  Định dạng số mặc định
    |--------------------------------------------------------------------------
    |
    | Định dạng mặc định này sẽ được áp dụng nếu bạn không thiết lập chúng trong phương
    | thức gọi.
    |
    */

    'format' => [

        'decimals' => 0,

        'decimal_point' => '.',

        'thousand_seperator' => ','

    ],

];